<template>
  <a-layout class="!min-h-screen">
    <a-layout-sider v-model:collapsed="collapsed" collapsible @collapse="handleCollapse">
      <Aside />
    </a-layout-sider>
    <a-layout>
      <a-layout-header class="bg-white !p-0">
        <Header />
      </a-layout-header>
      <a-layout-content class="my-[24px] mx-[16px] bg-white overflow-hidden layout-content">
        <Main />
      </a-layout-content>
    </a-layout>
  </a-layout>
</template>
<script lang="ts" setup>
import Aside from "./components/Aside.vue";
import Header from "./components/Header.vue";
import Main from "./components/Main.vue";
import { ref } from "vue";
import { useLayoutStore } from "/@/store/layout";

const collapsed = ref<boolean>(false);
const layoutStore = useLayoutStore()

function handleCollapse(collapsed: boolean) {
  console.log(collapsed);
  layoutStore.setCollapse(collapsed)
}

/*
编码挑战 #1

Mark 和 John 正在尝试比较他们的 BMI（身体质量指数），该指数使用以下公式计算：BMI = 质量 / 身高 ** 2 = 质量 /（身高 * 身高）。 （质量单位为公斤，高度单位为米）。

1. 将 Mark 和 John 的质量和高度存储在变量中
2. 使用公式计算他们的BMI（你甚至可以实现两个版本）
3. 创建一个布尔变量“markHigherBMI”，其中包含有关 Mark 的 BMI 是否高于 John 的信息。

测试数据 1：标记重 78 kg，高 1.69 m。 John 体重 92 kg，身高 1.95 m。
测试数据 2：标记重 95 kg，高 1.88 m。 约翰体重 85 kg，身高 1.76 m。

祝你好运 😀
*/
const weightMark = 78;
const heightMark = 1.69;
const weightJohn = 92;
const heightJohn = 1.95;

const BMIMark = weightMark / heightMark ** 2
const BMIJohn = weightJohn / heightJohn ** 2
const markHigherBMI = BMIMark > BMIJohn
console.log(markHigherBMI);


/*
编码挑战 #2
使用 编码挑战 #1 中的 BMI 示例和您已经编写的代码，并对其进行改进：

1. 在控制台打印一个漂亮的输出，说明谁的 BMI 更高。 消息可以是“Mark 的 BMI 比 John 的高！” 或“约翰的 BMI 比马克的高！”
2. 使用模板文字将 BMI 值包含在输出中。 示例：“Mark 的 BMI (28.3) 高于 John 的 (23.9)！”

提示：使用 if/else 语句😉

祝你好运 😀
*/


/*
编码挑战 #3

有两个体操队，海豚队和考拉队。他们相互竞争 3 次。平均分最高的获胜者赢得奖杯！

1. 使用下面的测试数据计算每支球队的平均分
2. 比较队伍的平均分来决定比赛的获胜者，并打印到控制台。不要忘记可能会有平局，因此也要对此进行测试（平局意味着他们的平均得分相同）。

3. 奖励 1：包括最低分数为 100 的要求。在此规则下，只有当一个团队的得分高于另一团队并且同时得分至少为 100 分时，它才会获胜。提示：使用逻辑运算符来测试最低分数，以及多个 else-if 块😉
4. 奖励 2：最低分数也适用于平局！因此，只有当两支球队得分相同且得分大于或等于 100 分时，才会发生平局。否则，没有球队赢得奖杯。

测试数据：海豚得分 96、108 和 89。考拉得分 88、91 和 110
测试数据奖励 1：海豚得分 97、112 和 101。考拉得分 109、95 和 123
测试数据奖励 2：海豚得分 97、112 和 101。考拉得分 109、95 和 106

祝你好运 😀
*/


/*
编码挑战 #4

Steven 想为他在餐馆吃饭时构建一个非常简单的小费计算器。 在他的国家，如果账单价值在 50 到 300 之间，通常给 15% 的小费。如果值不同，小费是 20%。

1. 你的任务是根据账单价值计算小费。 为此创建一个名为“tip”的变量。 不允许使用 if/else 语句😅（如果你觉得更简单，你可以从 if/else 语句开始，然后尝试将其转换为三元运算符！）
2. 将一个字符串打印到控制台，其中包含账单金额、小费和最终值（账单 + 小费）。 示例：'账单为 275，小费为 41.25，总价值为 316.25'

测试数据：测试钞票价值 275、40 和 430

提示：要计算一个值的 20%，只需将其乘以 20/100 = 0.2
提示：值 X 介于 50 和 300 之间，如果它 >= 50 && <= 300 😉

祝你好运 😀
*/

</script>
<style>
.site-layout .site-layout-background {
  background: #fff;
}

[data-theme="dark"] .site-layout .site-layout-background {
  background: #141414;
}

.layout-content {
  height: calc(100vh - 112px);
}

::-webkit-scrollbar {
  width: 8px;
}

::-webkit-scrollbar-track {
  background-color: #F5F5F5;
}

::-webkit-scrollbar-thumb {
  border-radius: 10px;
  background-color: rgb(206, 206, 206);
}
</style>
